init.el

(use-package hydra
   :ensure t)

;; Buffers
(defun nmkip/swap-buffers-to-window (windownum follow-focus-p)
      "Swaps visible buffers between active window and selected window.
      follow-focus-p controls whether focus moves to new window (with buffer), or
      stays on current"
      (interactive)
      (if (> windownum (length (window-list-1 nil nil t)))
          (message "No window numbered %s" windownum)
        (let* ((b1 (current-buffer))
               (w1 (selected-window))
               (w2 (winum-get-window-by-number windownum))
               (b2 (window-buffer w2)))
          (unless (eq w1 w2)
            (set-window-buffer w1 b2)
            (set-window-buffer w2 b1)
            (unrecord-window-buffer w1 b1)
            (unrecord-window-buffer w2 b2)))
        (when follow-focus-p (winum-select-window-by-number windownum))))

;; define and evaluate numbered functions:
;; buffer-to-window-1 to 9
(dotimes (i 9)
(let ((n (+ i 1)))
    (eval `(defun ,(intern (format "buffer-to-window-%s" n)) (&optional arg)
            ,(format "Move buffer to the window with number %i." n)
            (interactive "P")
            (nmkip/swap-buffers-to-window ,n t)))))

(defun nmkip/show-messages-buffer ()
  (interactive)
  (switch-to-buffer (messages-buffer)))

(defun nmkip/show-scratch-buffer ()
  (interactive)
  (switch-to-buffer "*scratch*"))

;; Windows
(defun nmkip/maximize-window ()
  "Maximize window"
  (interactive)
  (save-excursion
      (if (and (= 1 (length (window-list)))
               (assoc ?_ register-alist))
          (jump-to-register ?_)
          (progn
              (window-configuration-to-register ?_)
              (delete-other-windows)))))

;; Make ESC quit prompts
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)

  (use-package general
    :config
    (general-create-definer nmkip/leader-keys
      :keymaps '(normal insert visual emacs)
      :prefix "SPC"
      :global-prefix "C-SPC")

    (nmkip/leader-keys
      "b"  '(:ignore t :which-key "buffers")
      "f"  '(:ignore t :which-key "files")
      "g"  '(:ignore t :which-key "git")
      "h"  '(:ignore t :which-key "help")
      "w"  '(:ignore t :which-key "windows")

      "SPC" '(counsel-M-x :which-key "M-x")
      "TAB" '(evil-switch-to-windows-last-buffer :which-key "Last buffer")
      "/" '(swiper :which-key "swiper")

      ;; Buffers
      "b1" '(buffer-to-window-1 :which-key "Move buffer to window 1")
      "b2" '(buffer-to-window-2 :which-key "Move buffer to window 2")
      "b3" '(buffer-to-window-3 :which-key "Move buffer to window 3")
      "b4" '(buffer-to-window-4 :which-key "Move buffer to window 4")
      "b5" '(buffer-to-window-5 :which-key "Move buffer to window 5")
      "b6" '(buffer-to-window-6 :which-key "Move buffer to window 6")
      "b7" '(buffer-to-window-7 :which-key "Move buffer to window 7")
      "b8" '(buffer-to-window-8 :which-key "Move buffer to window 8")
      "b9" '(buffer-to-window-9 :which-key "Move buffer to window 9")
      "bn" '(next-buffer :which-key "Next buffer")
      "bN" '(previous-buffer :which-key "Previous buffer")
      "bp" '(previous-buffer :which-key "Previous buffer")
      "bb" '(counsel-switch-buffer :which-key "Switch buffer")
      "bd" '(kill-this-buffer :which-key "Delete buffer")
      "bD" '(kill-buffer-and-window :which-key "Delete buffer and window")
      "bm" '(nmkip/show-messages-buffer :which-key "Messages buffer")
      "bs" '(nmkip/show-scratch-buffer :which-key "Scratch buffer")
      "br" '(Revert buffer :which-key "Revert buffer")

      ;; Files
      "fs" '(save-buffer :which-key "Save file")
      "fS" '(evil-write-all :which-key "Save all files")
      "fr" '(counsel-recentf :which-key "Recent files")
      "fR" '(rename-file :which-key "Rename file")

      ;; git
      ;; TODO: Add transient state: move to next/prev hunk. 
      "gs" '(magit-status :which-key "Next buffer")

      ;; help
      "ha" '(counsel-apropos :which-key "Apropos")
      "hb" '(counsel-describe-binds :which-key "Describe binds")
      "hf" '(counsel-describe-function :which-key "Describe function")
      "hF" '(counsel-describe-face :which-key "Describe face")
      "hk" '(describe-key :which-key "Describe key")
      "hm" '(describe-mode :which-key "Describe mode")
      "hp" '(describe-package :which-key "Describe package")
      "hs" '(counsel-symbol :which-key "Describe symbol")
      "ht" '(describe-theme :which-key "Describe theme")
      "hv" '(counsel-describe-variable :which-key "Describe variable")

      ;; Windows
      "w=" '(balance-windows :which-key "Balance windows")
      "wd" '(delete-window :which-key "Delete window")
      "wD" '(delete-other-windows :which-key "Delete other windows")
      "wh" '(evil-window-left :which-key "Focus window left")
      "wH" '(evil-window-move-far-left :which-key "Move far left")
      "wj" '(evil-window-down :which-key "Focus window down")
      "wJ" '(evil-window-move-very-bottom :which-key "Move very bottom")
      "wk" '(evil-window-up :which-key "Focus window up")
      "wK" '(evil-window-move-very-top :which-key "Move very top")
      "wl" '(evil-window-right :which-key "Focus window right")
      "wL" '(evil-window-move-far-right :which-key "Move far right")
      "wm" '(nmkip/maximize-window :which-key "Maximize window")
      "wr" '(winner-redo :which-key "Winner redo")
      "ws" '(split-window-below :which-key "Split horizontally")
      "wu" '(winner-undo :which-key "Winner undo")
      "wv" '(split-window-right :which-key "Split vertically")

      ))

(defhydra hydra-buffers (:hint nil)
    "
Buffer Transient State
[_n_]: next buffer [_p_/_N_]: previous buffer "
    ("n" next-buffer)
    ("N" previous-buffer)
    ("p" previous-buffer)
    ("q" nil "quit" :color blue))

(nmkip/leader-keys
    "b." '(hydra-buffers/body :which-key "Buffer transient state")
    "b," '(hydra-buffers/previous-buffer :which-key "Buffer transient state")
)

(defhydra hydra-windows (:hint nil)
    "Window Transient State
    "
    ("[" shrink-window-horizontally "shrink" :column "horizontal")
    ("]" enlarge-window-horizontally "enlarge" :column "horizontal")
    ("{" shrink-window "shrink" :column "vertical")
    ("}" enlarge-window "enlarge" :column "vertical")
    ("q" nil "quit" :color blue :column nil)
) 


(nmkip/leader-keys
    "w." '(hydra-windows/body :which-key "Windows transient state")
    "w[" '(hydra-windows/shrink-window-horizontally :which-key "Shrink window horizontally")
    "w]" '(hydra-windows/enlarge-window-horizontally :which-key "Enlarge window horizontally")
    "w{" '(hydra-windows/shrink-window :which-key "Shrink window vertically")
    "w}" '(hydra-windows/enlarge-window :which-key "Enlarge window vertically"))

(use-package evil
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-want-C-u-scroll t)
  (setq evil-want-C-i-jump nil)
  :config
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
  (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

  ;; Use visual line motions even outside of visual-line-mode buffers
  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal))

(use-package evil-collection
  :after evil
  :config (evil-collection-init))
