Emacs.org
** Auto-tangle Configuration Files

This snippet adds a hook to =org-mode= buffers so that =nmkip/org-babel-tangle-config= gets executed each time such a buffer gets saved.  This function checks to see if the file being saved is the Emacs.org file you're looking at right now, and if so, automatically exports the configuration here to the associated output files.

#+begin_src emacs-lisp

  ;; Automatically tangle our Emacs.org config file when we save it
  (defun nmkip/org-babel-tangle-config ()
    (when (string-equal (buffer-file-name)
                        (expand-file-name emacs-org-config-path))
      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'nmkip/org-babel-tangle-config)))

#+end_src

* Flycheck

#+begin_src emacs-lisp

  (use-package flycheck
    :ensure t
    :init (global-flycheck-mode))

#+end_src

** Keybindings

#+begin_src emacs-lisp
  (defhydra hydra-flycheck (:hint nil)
    "
  Flycheck Transient State
  [_n_]: next error [_p_/_N_]: previous error "
    ("n" flycheck-next-error)
    ("N" flycheck-previous-error)
    ("p" flycheck-previous-error)
    ("q" nil "quit" :color blue))

  (nmkip/leader-keys
    "e" '(:ignore t :which-key "errors")

    "e." '(hydra-flycheck/body :which-key "Flycheck transient state")
    "el" '(flycheck-list-errors :which-key "List errors")
    "en" '(hydra-flycheck/flycheck-next-error :which-key "Next error")
    "eN" '(hydra-flycheck/flycheck-previous-error :which-key "Previous error")
    "ep" '(hydra-flycheck/flycheck-previous-error :which-key "Next error")
    "ev" '(flycheck-verify-setup :which-key "Verify setup")
    "ev" '(flycheck-verify-setup :which-key "Verify setup")
    )
#+end_src

* Development
** Languages
*** Lisps
#+begin_src emacs-lisp

          (defhydra hydra-lisp ()
           "Lisp State"
            ("b" sp-forward-barf-sexp "forward barf")
            ("B" sp-backward-barf-sexp "backward barf")
            ("s" sp-forward-slurp-sexp "forward slurp")
            ("S" sp-backward-slurp-sexp "backward slurp")
            ("h" evil-cp-backward-symbol-begin "backward symbol")
            ("j" evil-cp-next-closing "next closing")
            ("k" evil-cp-previous-opening "previous opening")
            ("l" evil-cp-forward-symbol-begin "forward symbol")
            ("r" sp-raise-sexp "raise sexp")
            ("t" sp-transpose-sexp "transpose sexp")
            ("w" sp-rewrap-sexp "rewrap sexp")
            ("y" sp-copy-sexp "copy sexp")
            ("[" sp-wrap-square "wrap []")
            ("(" sp-wrap-round "wrap ()")
            ("{" sp-wrap-curly "wrap {}")
            ("q" nil "quit" :exit t))

          (nmkip/local-leader-keys 'normal '(emacs-lisp-mode-map
                                             clojure-mode-map
                                             cider-repl-mode-map
                                             lisp-interaction-mode-map)
            "," '(hydra-lisp/body :which-key "Lisp transient state"))

          (nmkip/leader-keys 'normal '(emacs-lisp-mode-map
                                       clojure-mode-map
                                       cider-repl-mode-map
                                       lisp-interaction-mode-map)

            "k." '(hydra-lisp/body :which-key "Lisp transient state")
            "kb" '(hydra-lisp/sp-forward-barf-sexp :which-key "forward barf")
            "kB" '(hydra-lisp/sp-backward-barf-sexp :which-key "backward barf")
            "ks" '(hydra-lisp/sp-forward-slurp-sexp :which-key "forward slurp")
            "kS" '(hydra-lisp/sp-backward-slurp-sexp :which-key "backward slurp")
            "kh" '(hydra-lisp/evil-cp-backward-symbol-begin :which-key "backward symbol")
            "kj" '(hydra-lisp/evil-cp-next-closing :which-key "next closing")
            "kk" '(hydra-lisp/evil-cp-previous-opening :which-key "previous opening")
            "kl" '(hydra-lisp/evil-cp-forward-symbol-begin :which-key "forward symbol")
            "kr" '(hydra-lisp/sp-raise-sexp :which-key "raise sexp")
            "kt" '(hydra-lisp/sp-transpose-sexp :which-key "transpose sexp")
            "kw" '(hydra-lisp/sp-rewrap-sexp :which-key "rewrap sexp")
            "ky" '(hydra-lisp/sp-copy-sexp :which-key "copy sexp")
            "k[" '(hydra-lisp/sp-wrap-square :which-key "wrap []")
            "k(" '(hydra-lisp/sp-wrap-round :which-key "wrap ()")
            "k{" '(hydra-lisp/sp-wrap-curly :which-key "wrap {}"))

#+end_src
*** IDE Features with lsp-mode

**** lsp-mode

We use the excellent [[https://emacs-lsp.github.io/lsp-mode/][lsp-mode]] to enable IDE-like functionality for many different programming languages via "language servers" that speak the [[https://microsoft.github.io/language-server-protocol/][Language Server Protocol]].  Before trying to set up =lsp-mode= for a particular language, check out the [[https://emacs-lsp.github.io/lsp-mode/page/languages/][documentation for your language]] so that you can learn which language servers are available and how to install them.

The =lsp-keymap-prefix= setting enables you to define a prefix for where =lsp-mode='s default keybindings will be added.  I *highly recommend* using the prefix to find out what you can do with =lsp-mode= in a buffer.

The =which-key= integration adds helpful descriptions of the various keys so you should be able to learn a lot just by pressing =C-c l= in a =lsp-mode= buffer and trying different things that you find there.

#+begin_src emacs-lisp :tangle no

  (defun efs/lsp-mode-setup ()
    (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
    (lsp-headerline-breadcrumb-mode))

  (use-package lsp-mode
    :commands (lsp lsp-deferred)
    :hook (lsp-mode . efs/lsp-mode-setup)
    :init
    (setq lsp-keymap-prefix "C-c l")  ;; Or 'C-l', 's-l'
    :config
    (lsp-enable-which-key-integration t))

#+end_src

**** lsp-ui

[[https://emacs-lsp.github.io/lsp-ui/][lsp-ui]] is a set of UI enhancements built on top of =lsp-mode= which make Emacs feel even more like an IDE.  Check out the screenshots on the =lsp-ui= homepage (linked at the beginning of this paragraph) to see examples of what it can do.

#+begin_src emacs-lisp :tangle no

  (use-package lsp-ui
    :hook (lsp-mode . lsp-ui-mode)
    :custom
    (lsp-ui-doc-position 'bottom))

#+end_src

**** lsp-treemacs

[[https://github.com/emacs-lsp/lsp-treemacs][lsp-treemacs]] provides nice tree views for different aspects of your code like symbols in a file, references of a symbol, or diagnostic messages (errors and warnings) that are found in your code.

Try these commands with =M-x=:

- =lsp-treemacs-symbols= - Show a tree view of the symbols in the current file
- =lsp-treemacs-references= - Show a tree view for the references of the symbol under the cursor
- =lsp-treemacs-error-list= - Show a tree view for the diagnostic messages in the project

This package is built on the [[https://github.com/Alexander-Miller/treemacs][treemacs]] package which might be of some interest to you if you like to have a file browser at the left side of your screen in your editor.

#+begin_src emacs-lisp :tangle no

  (use-package lsp-treemacs
    :after lsp)

#+end_src

**** lsp-ivy

[[https://github.com/emacs-lsp/lsp-ivy][lsp-ivy]] integrates Ivy with =lsp-mode= to make it easy to search for things by name in your code.  When you run these commands, a prompt will appear in the minibuffer allowing you to type part of the name of a symbol in your code.  Results will be populated in the minibuffer so that you can find what you're looking for and jump to that location in the code upon selecting the result.

Try these commands with =M-x=:

- =lsp-ivy-workspace-symbol= - Search for a symbol name in the current project workspace
- =lsp-ivy-global-workspace-symbol= - Search for a symbol name in all active project workspaces

#+begin_src emacs-lisp :tangle no

  (use-package lsp-ivy)

#+end_src

*** TypeScript

This is a basic configuration for the TypeScript language so that =.ts= files activate =typescript-mode= when opened.  We're also adding a hook to =typescript-mode-hook= to call =lsp-deferred= so that we activate =lsp-mode= to get LSP features every time we edit TypeScript code.

#+begin_src emacs-lisp :tangle no

  (use-package typescript-mode
    :mode "\\.ts\\'"
    :hook (typescript-mode . lsp-deferred)
    :config
    (setq typescript-indent-level 2))

#+end_src

*Important note!*  For =lsp-mode= to work with TypeScript (and JavaScript) you will need to install a language server on your machine.  If you have Node.js installed, the easiest way to do that is by running the following command:

#+begin_src shell :tangle no

npm install -g typescript-language-server typescript

#+end_src

This will install the [[https://github.com/theia-ide/typescript-language-server][typescript-language-server]] and the TypeScript compiler package.

*** TODO Javascript

Check this out. Maybe [[https://github.com/felipeochoa/rjsx-mode/][rjsx-mode]] for jsx files?
[[https://github.com/mooz/js2-mode][js2-mode]] says there are some tradeoffs. Which ones?

#+begin_src emacs-lisp :tangle no
  (use-package js2-mode)
  (use-package rjsx-mode)
#+end_src

*** Clojure

#+begin_src emacs-lisp

      (defun nmkip/clojure-mode-hook ()
        (clj-refactor-mode 1)
        (yas-minor-mode 1))

      (use-package flycheck-clj-kondo
        :ensure t)

      (use-package clojure-mode
        :hook (clojure-mode . nmkip/clojure-mode-hook)
        :ensure t
        :config (require 'flycheck-clj-kondo))

      (use-package cider
        :ensure t
        :config
          (evil-collection-cider-setup))

      (use-package clj-refactor)

#+end_src

**** Keybindings

#+begin_src emacs-lisp

  (defun nmkip/cider-eval-sexp-end-of-line ()
      (interactive)
      (save-excursion
        (end-of-line)
        (cider-eval-last-sexp)))

  (defun nmkip/cider-pprint-eval-sexp-end-of-line ()
      (interactive)
      (save-excursion
        (end-of-line)
        (cider-pprint-eval-last-sexp)))

#+end_src

#+begin_src emacs-lisp
  (nmkip/local-leader-keys '(normal visual) clojure-mode-map
    "=" '(:ignore t :which-key "format")
    "=e" '(:ignore t :which-key "edn")
    "d" '(:ignore t :which-key "debug")
    "e" '(:ignore t :which-key "evaluation")
    "e;" '(:ignore t :which-key "comment")
    "h" '(:ignore t :which-key "help")
    "r" '(:ignore t :which-key "refactor")
    "t" '(:ignore t :which-key "tests")
    "T" '(:ignore t :which-key "toggle")

    "'" 'sesman-start 

    ;; Format
    "==" '(cider-format-buffer :which-key "Format buffer")
    "=f" '(cider-format-defun :which-key "Format function")
    "=r" '(cider-format-region :which-key "Format region")

    ;; Format edn
    "=eb" '(cider-format-edn-buffer :which-key "Format edn buffer")
    "=ee" '(cider-format-edn-last-sexp :which-key "Format edn last sexp")
    "=er" '(cider-format-edn-region :which-key "Format edn region")

    ;; Debug
    "df" '(cider-debug-defun-at-point :which-key "Debug function")
    "di" '(cider-inspect :which-key "Cider inspect")

    ;; Evaluation
    "e$" '(nmkip/cider-eval-sexp-end-of-line :which-key "Eval line")
    "eb" '(cider-eval-buffer :which-key "Eval buffer")
    "ee" '(cider-eval-last-sexp :which-key "Eval sexp before point")
    "ef" '(cider-eval-defun-at-point :which-key "Eval function")
    "el" '(nmkip/cider-eval-sexp-end-of-line :which-key "Eval line")
    "em" '(cider-macroexpand-1 :which-key "Macroexpand")
    "eM" '(cider-macroexpand-all :which-key "Macroexpand all")
    "ev" '(cider-eval-sexp-at-point :which-key "Eval sexp at point")
    "eL" '(nmkip/cider-pprint-eval-sexp-end-of-line :which-key "Eval pprint line")
    "eF" '(cider-pprint-eval-defun-at-point :which-key "Eval pprint function")

    ;; Evaluation to comment
    "e;f" '(cider-eval-defun-to-comment :which-key "Eval function")
    "e;F" '(cider-pprint-eval-defun-to-comment :which-key "Eval pprint function")

    ;; Help
    "ha" '(cider-apropos :which-key "Apropos")
    "hd" '(cider-clojuredocs :which-key "Clojuredocs")
    "hh" '(cider-doc :which-key "Doc")
    "hj" '(cider-javadoc :which-key "Javadoc")
    "hn" '(cider-brose-ns :which-key "Browse ns")
    "hr" '(cljr-describe-refactoring :which-key "Describe refactoring")
    "hs" '(cider-browse-spec :which-key "Browse spec")
    "hS" '(cider-browse-spec-all :which-key "Browse all specs")

    "ra" '(:ignore t :which-key "Add")
    "rai" '(cljr-add-import-to-ns :which-key "Add import")
    "ral" '(cljr-introduce-let :which-key "Add let")
    "ram" '(cljr-add-missing-libspec :which-key "Add missing dependency")
    "rap" '(cljr-add-project-dependency :which-key "Add project dependency")
    "rar" '(cljr-add-require-to-ns :which-key "Add require")
    "ras" '(cljr-add-stubs :which-key "Add stubs for protocol at point")

    "rh" '(cljr-describe-refactoring :which-key "Describe refactoring")

    "rf" '(:ignore t :which-key "Function")
    "rfc" '(cljr-create-fn-from-example :which-key "Create")
    "rfp" '(cljr-promote-function :which-key "Promote/Extract")

    "ri" '(:ignore t :which-key "Inline")
    "ril" '(cljr-remove-let :which-key "Remove let and inline")
    "ris" '(cljr-inline-symbol :which-key "Inline symbol")

    "rr" '(cljr-rename-symbol :which-key "Rename symbol")

    "rt" '(:ignore t :which-key "Thread")
    "rtf" '(cljr-thread-first-all :which-key "Thread first all")
    "rti" '(cljr-thread :which-key "Thread into current thread")
    "rtl" '(cljr-thread-last-all :which-key "Thread last all")
    "rtu" '(cljr-unwind-all :which-key "Unwind entire thread")
    "rtU" '(cljr-unwind :which-key "Unwind one thread step")

    ;; Tests
    "ta" '(cider-test-run-project-tests :which-key "Run all")
    "tb" '(cider-test-show-report :which-key "Show report")
    "tl" '(cider-test-run-loaded-tests :which-key "Run all loaded")
    "tn" '(cider-test-run-ns-tests :which-key "Run ns")
    "tr" '(cider-test-rerun-failed-tests :which-key "Run failed")
    "tt" '(cider-test-run-test :which-key "Run test at point")

    ;; Toggle
    "Te" '(cider-enlighten-mode :which-key "Cider enlighten mode")
    "Tt" '(cider-auto-test-mode :which-key "Cider auto-test mode")
   )

#+end_src

*** Emacs Lisp

**** Keybindings

#+begin_src emacs-lisp

  (defun nmkip/elisp-eval-sexp-end-of-line ()
    (interactive)
    (save-excursion
      (end-of-line)
      (eval-last-sexp nil)))

#+end_src

#+begin_src emacs-lisp
  (nmkip/local-leader-keys '(normal visual) '(emacs-lisp-mode-map lisp-interaction-mode-map)
    "=" '(:ignore t :which-key "format")
    "d" '(:ignore t :which-key "debug")
    "e" '(:ignore t :which-key "evaluation")
    "h" '(:ignore t :which-key "help")
    "r" '(:ignore t :which-key "refactor")
    "t" '(:ignore t :which-key "tests")
    "T" '(:ignore t :which-key "toggle")

    "'" 'ielm

    ;; Evaluation
    "e$" '(nmkip/elisp-eval-sexp-end-of-line :which-key "Eval line")
    "eb" '(eval-buffer :which-key "Eval buffer")
    "ee" '(eval-last-sexp :which-key "Eval sexp before point")
    "ef" '(eval-defun :which-key "Eval function")
    "el" '(nmkip/elisp-eval-sexp-end-of-line :which-key "Eval line")
    "er" '(eval-region :which-key "Eval region")
  
    ;; Help
    "hh" '(helpful-at-point :which-key "Helpful doc")
   )
#+end_src

