init.el

;; Automatically tangle our Emacs.org config file when we save it
(defun nmkip/org-babel-tangle-config ()
  (when (string-equal (buffer-file-name)
                      (expand-file-name emacs-org-config-path))
    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'nmkip/org-babel-tangle-config)))

(use-package cider
  :mode "\\.clj[sc]?\\'"
  :config
  (evil-collection-cider-setup))
