Emacs.org
** Company Mode

[[http://company-mode.github.io/][Company Mode]] provides a nicer in-buffer completion interface than =completion-at-point= which is more reminiscent of what you would expect from an IDE.  We add a simple configuration to make the keybindings a little more useful (=TAB= now completes the selection and initiates completion at the current location if needed).

We also use [[https://github.com/sebastiencs/company-box][company-box]] to further enhance the look of the completions with icons and better overall presentation.

#+begin_src emacs-lisp

  (use-package company
    :hook
    (clojure-mode . company-mode)
    (emacs-lisp-mode . company-mode)
    (lisp-interaction-mode . company-mode)
    :bind (:map company-active-map
                ("C-w" . evil-delete-backward-word)
                ("<tab>" . company-complete-selection))
    :custom
    (company-minimum-prefix-length 1)
    (company-idle-delay 0.0)
    (company-show-numbers t))

  (use-package company-box
    :hook (company-mode . company-box-mode))

  ;; Maybe this
  ;;("<tab>" . company-indent-or-complete-common)

  ;; Workaround evil-mode had higher priority when company-mode was active.
  (with-eval-after-load 'company
    (add-hook 'evil-local-mode-hook
              (lambda ()
                ;; Note:
                ;; Check if `company-emulation-alist' is in
                ;; `emulation-mode-map-alists', if true, call
                ;; `company-ensure-emulation-alist' to ensure
                ;; `company-emulation-alist' is the first item of
                ;; `emulation-mode-map-alists', thus has a higher
                ;; priority than keymaps of evil-mode.
                ;; We raise the priority of company-mode keymaps
                ;; unconditionally even when completion is not
                ;; activated. This should not cause problems,
                ;; because when completion is activated, the value of
                ;; `company-emulation-alist' is ((t . company-my-keymap)),
                ;; when completion is not activated, the value is ((t . nil)).
                (when (memq 'company-emulation-alist emulation-mode-map-alists)
                  (company-ensure-emulation-alist)))))

#+end_src
** Projectile

[[https://projectile.mx/][Projectile]] is a project management library for Emacs which makes it a lot easier to navigate around code projects for various languages.  Many packages integrate with Projectile so it's a good idea to have it installed even if you don't use its commands directly.

#+begin_src emacs-lisp

  (use-package projectile
    :diminish projectile-mode
    :config (projectile-mode)
    :custom ((projectile-completion-system 'ivy))
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :init
    ;; NOTE: Set this to the folder where you keep your Git repos!
    ;;(when (file-directory-p "~/projects")
      ;;(setq projectile-project-search-path '("~/projects")))
    (setq projectile-switch-project-action #'projectile-dired))

  (use-package counsel-projectile
    :config (counsel-projectile-mode))

#+end_src

*** Keybindings

#+begin_src emacs-lisp

  (defhydra hydra-projectile (:hint nil)
    "
Projectile Transient State
[_n_]: next buffer [_p_/_N_]: previous buffer "
    ("n" projectile-next-project-buffer)
    ("N" projectile-previous-project-buffer)
    ("p" projectile-previous-project-buffer)
    ("q" nil "quit" :color blue))

  (nmkip/leader-keys
    "p" '(:ignore t :which-key "projects")

    "p." '(hydra-projectile/body :which-key "Projectile transient state")
    "p*" '(projectile-clear-known-projects :which-key "clean-up")
    "p!" '(projectile-run-shell :which-key "shell")
    "pA" '(projectile-add-known-project :which-key "add project")
    "pb" '(counsel-projectile-switch-to-buffer :which-key "buffers")
    "pd" '(counsel-projectile-find-dir :which-key "find dirs")
    "pD" '(projectile-discover-projects-in-directory :which-key "discover")
    "pf" '(counsel-projectile-find-file :which-key "find file")
    "pK" '(projectile-kill-buffers :which-key "kill buffers")
    "pl" '(projectile-edit-dir-locals :which-key "dir locals")
    "pn" '(hydra-projectile/projectile-next-project-buffer :which-key "next buffer")
    "pN" '(hydra-projectile/projectile-previous-project-buffer :which-key "previous buffer")
    "ps" '(counsel-projectile-rg :which-key "search")
    "pS" '(projectile-multi-occur :which-key "multi-occur")
    "pp" '(counsel-projectile-switch-project :which-key "switch project")
    "pr" '(projectile-recentf :which-key "recent files")
    "pt" '(projectile-toggle-between-implementation-and-test :which-key "implementation<->test")
    "pT" '(projectile-find-test-file :which-key "find test file")
    )

#+end_src

** Commenting

Emacs' built in commenting functionality =comment-dwim= (usually bound to =M-;=) doesn't always comment things in the way you might expect so we use [[https://github.com/redguardtoo/evil-nerd-commenter][evil-nerd-commenter]] to provide a more familiar behavior.  I've bound it to =M-/= since other editors sometimes use this binding but you could also replace Emacs' =M-;= binding with this command.

#+begin_src emacs-lisp

  (use-package evil-nerd-commenter
    :bind ("M-/" . evilnc-comment-or-uncomment-lines))

#+end_src

** Magit

[[https://magit.vc/][Magit]] is the best Git interface I've ever used.  Common Git operations are easy to execute quickly using Magit's command panel system.

#+begin_src emacs-lisp

  (use-package magit
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

  (use-package evil-magit
    :after magit)

  ;; NOTE: Make sure to configure a GitHub token before using this package!
  ;; - https://magit.vc/manual/forge/Token-Creation.html#Token-Creation
  ;; - https://magit.vc/manual/ghub/Getting-Started.html#Getting-Started
  (use-package forge)

#+end_src

** Diff-hl

#+begin_src emacs-lisp

    (use-package diff-hl
      :hook
      (magit-pre-refresh-hook . diff-hl-magit-pre-refresh)
      (magit-post-refresh-hook . diff-hl-magit-post-refresh)
      :ensure t
      :config (global-diff-hl-mode)
    )

#+end_src

*** Keybindings

#+begin_src emacs-lisp
  (defhydra hydra-git (:hint nil)
    "
Git Transient State
[_d_]: diff [_x_]: discard hunk [_s_]: status [_n_]: next hunk [_p_/_N_]: previous hunk "
    ("d" vc-diff)
    ("n" diff-hl-next-hunk)
    ("N" diff-hl-previous-hunk)
    ("p" diff-hl-previous-hunk)
    ("s" magit-status)
    ("x" diff-hl-revert-hunk)
    ("q" nil "quit" :color blue))

  (nmkip/leader-keys
    "g." '(hydra-git/body :which-key "Git transient state")
    "gd" '(hydra-git/vc-diff :which-key "Show diff")
    "gn" '(hydra-git/diff-hl-next-hunk :which-key "Next hunk")
    "gN" '(hydra-git/diff-hl-previous-hunk :which-key "Previous hunk")
    "gp" '(hydra-git/diff-hl-previous-hunk :which-key "Previous hunk")
    "gx" '(hydra-git/diff-hl-revert-hunk :which-key "Revert hunk")
    )

#+end_src

** Productivity

*** Undo-tree

#+begin_src emacs-lisp

(use-package undo-tree
    :diminish undo-tree-mode
    :ensure t
    :config 
        (global-undo-tree-mode)
        (evil-set-undo-system 'undo-tree))

#+end_src

*** Smartparens

#+begin_src emacs-lisp

  (use-package smartparens
    :hook 
      (prog-mode . smartparens-mode)
      (emacs-lisp-mode . smartparens-strict-mode)
      (clojure-mode . smartparens-strict-mode)
      (cider-repl-mode . smartparens-strict-mode)
    :config
      (sp-local-pair sp-lisp-modes "'" nil :actions nil)
      (show-smartparens-global-mode))

  (defadvice evil-delete-backward-char-and-join
      (around evil-delete-backward-char-and-join activate)
      (if (and (bound-and-true-p smartparens-mode)
              (bound-and-true-p smartparens-strict-mode))
          (call-interactively 'sp-backward-delete-char)
          ad-do-it))

#+end_src

#+begin_src emacs-lisp 

      (use-package evil-cleverparens
        :hook
            (clojure-mode . evil-cleverparens-mode)
            (emacs-lisp-mode . evil-cleverparens-mode)
            (cider-repl-mode . evil-cleverparens-mode)
        :custom
            (evil-cleverparens-use-additional-bindings nil)
            (evil-cleverparens-use-additional-movement-keys nil)
        :general
            (:keymaps '(normal visual)
                      "M-[" 'evil-cp-beginning-of-defun
                      "M-]" 'evil-cp-end-of-defun))

#+end_src

*** Rainbow Delimiters

[[https://github.com/Fanael/rainbow-delimiters][rainbow-delimiters]] is useful in programming modes because it colorizes nested parentheses and brackets according to their nesting depth.  This makes it a lot easier to visually match parentheses in Emacs Lisp code without having to count them yourself.

#+begin_src emacs-lisp

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))

#+end_src

* Terminals

** term-mode

=term-mode= is a built-in terminal emulator in Emacs.  Because it is written in Emacs Lisp, you can start using it immediately with very little configuration.  If you are on Linux or macOS, =term-mode= is a great choice to get started because it supports fairly complex terminal applications (=htop=, =vim=, etc) and works pretty reliably.  However, because it is written in Emacs Lisp, it can be slower than other options like =vterm=.  The speed will only be an issue if you regularly run console apps with a lot of output.

One important thing to understand is =line-mode= versus =char-mode=.  =line-mode= enables you to use normal Emacs keybindings while moving around in the terminal buffer while =char-mode= sends most of your keypresses to the underlying terminal.  While using =term-mode=, you will want to be in =char-mode= for any terminal applications that have their own keybindings.  If you're just in your usual shell, =line-mode= is sufficient and feels more integrated with Emacs.

With =evil-collection= installed, you will automatically switch to =char-mode= when you enter Evil's insert mode (press =i=).  You will automatically be switched back to =line-mode= when you enter Evil's normal mode (press =ESC=).

Run a terminal with =M-x term!=

*Useful key bindings:*

- =C-c C-p= / =C-c C-n= - go back and forward in the buffer's prompts (also =[[= and =]]= with evil-mode)
- =C-c C-k= - Enter char-mode
- =C-c C-j= - Return to line-mode
- If you have =evil-collection= installed, =term-mode= will enter char mode when you use Evil's Insert mode

#+begin_src emacs-lisp

  (use-package term
    :config
    (setq explicit-shell-file-name "bash") ;; Change this to zsh, etc
    ;;(setq explicit-zsh-args '())         ;; Use 'explicit-<shell>-args for shell-specific args

    ;; Match the default Bash shell prompt.  Update this if you have a custom prompt
    (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *"))

#+end_src

*** Better term-mode colors

The =eterm-256color= package enhances the output of =term-mode= to enable handling of a wider range of color codes so that many popular terminal applications look as you would expect them to.  Keep in mind that this package requires =ncurses= to be installed on your machine so that it has access to the =tic= program.  Most Linux distributions come with this program installed already so you may not have to do anything extra to use it.

#+begin_src emacs-lisp

  (use-package eterm-256color
    :hook (term-mode . eterm-256color-mode))

#+end_src

** vterm

[[https://github.com/akermu/emacs-libvterm/][vterm]] is an improved terminal emulator package which uses a compiled native module to interact with the underlying terminal applications.  This enables it to be much faster than =term-mode= and to also provide a more complete terminal emulation experience.

Make sure that you have the [[https://github.com/akermu/emacs-libvterm/#requirements][necessary dependencies]] installed before trying to use =vterm= because there is a module that will need to be compiled before you can use it successfully.

#+begin_src emacs-lisp

  (use-package vterm
    :commands vterm
    :config
    (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *")  ;; Set this to match your custom shell prompt
    ;;(setq vterm-shell "zsh")                       ;; Set this to customize the shell to launch
    (setq vterm-max-scrollback 10000))

#+end_src

** shell-mode

[[https://www.gnu.org/software/emacs/manual/html_node/emacs/Interactive-Shell.html#Interactive-Shell][shell-mode]] is a middle ground between =term-mode= and Eshell.  It is *not* a terminal emulator so more complex terminal programs will not run inside of it.  It does have much better integration with Emacs because all command input in this mode is handled by Emacs and then sent to the underlying shell once you press Enter.  This means that you can use =evil-mode='s editing motions on the command line, unlike in the terminal emulator modes above.

*Useful key bindings:*

- =C-c C-p= / =C-c C-n= - go back and forward in the buffer's prompts (also =[[= and =]]= with evil-mode)
- =M-p= / =M-n= - go back and forward in the input history
- =C-c C-u= - delete the current input string backwards up to the cursor
- =counsel-shell-history= - A searchable history of commands typed into the shell

One advantage of =shell-mode= on Windows is that it's the only way to run =cmd.exe=, PowerShell, Git Bash, etc from within Emacs.  Here's an example of how you would set up =shell-mode= to run PowerShell on Windows:

#+begin_src emacs-lisp

  (when (eq system-type 'windows-nt)
    (setq explicit-shell-file-name "powershell.exe")
    (setq explicit-powershell.exe-args '()))

#+end_src

